Repository: argrath/activitypub
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: The inbox is discovered through the inbox property of an actor's profile.
ja: inbox は actor のプロファイルの inbox プロパティを使って発見される。

source: The inbox stream contains all activities received by the actor.
ja: inbox ストリームは actor が受信した全てのアクティビティを含む。

source: The inboxes of actors on federated servers accepts HTTP POST requests, with behaviour described in Delivery.
ja: 連合サーバ上の actor の inbox は HTTP POST リクエストを受け付ける; その振る舞いは Delivery に記述されている。

source: The key words MAY, MUST, MUST NOT, SHOULD, and SHOULD NOT are to be interpreted as described in [RFC2119].
ja: キーワードMAY, MUST, MUST NOT, SHOULD, SHOULD NOT は、 [RFC2119] に 記述されているように解釈される。

source: The object's unique global identifier (unless the object is transient, in which case the id MAY be omitted).
ja: オブジェクトのユニークなグローバル識別子(オブジェクトが一時的なものの場合を 除く; この場合 id は省略しても良い(MAY))。

source: The official document is an English version.
ja: 正式な文書は英語版です。

source: The outbox accepts HTTP POST requests, with behaviour described in Client to Server Interactions.
ja: outbox は HTTP POST リクエストを受け付ける; その振る舞いは クライアントからサーバへの通信に 記述されている。

source: The outbox is discovered through the outbox property of an actor's profile.
ja: outbox は actor のプロファイルの outbox プロパティを使って発見される。

source: The outbox stream contains activities the user has published, subject to the ability of the requestor to retrieve the activity (that is, the contents of the outbox are filtered by the permissions of the person reading it).
ja: outboxストリームは、要求者がアクティビティを取得する能力があるという前提で、 ユーザーが発行したアクティビティを含む (つまり、outbox の内容はそれを読む人の権限によってフィルタされる)。

source: The preferred "nickname" or "display name" of the actor.
ja: actor の、望ましい「ニックネーム」や「表示名」。

source: The receiving outbox can then perform delivery to not only the followers of Chris (the liker), but also to Amy, and Amy's followers and Evan, both of whom received the original article.
ja: 受信した outbox は、(いいねした) Chris のフォロワーだけでなく、 元の記事を受け取っている Amy、Amy のフォロワー、Evan にも 配送できる。

source: The receiving server MUST take care to be sure that the Update is authorized to modify its object.
ja: 受信サーバは Update がその object を修正する権限があることを 確認することに注意しなければならない(MUST)。

source: The request MUST be authenticated with the credentials of the user to whom the outbox belongs.
ja: このリクエストは、outbox を所有するユーザーの認証情報で 認証されなければならない(MUST)。

source: The scope and restrictions of the Undo activity are the same as for the Undo activity in the context of client to server interactions, but applied to a federated context.
ja: Undo アクティビティのスコープと制限は クライアントサーバ間での Undo アクティビティ と同様であるが、 連合コンテキストに適用される。

source: The server MAY filter its delivery targets according to implementation-specific rules (for example, spam filtering).
ja: サーバは配送ターゲットを実装依存の規則(例えば spam フィルタ)で フィルタリングしてもよい(MAY)。

source: The server MUST NOT add the actor to the receiver's Following Collection.
ja: サーバは受信者の Following Collection に actor を追加してはならない(MUST)。

source: The server MUST accept a valid [ActivityStreams] object that isn't a subtype of Activity in the POST request to the outbox.
ja: サーバは outbox への POST リクエストで、 Activity のサブタイプでない 正当な [ActivityStreams] オブジェクトを受け入れなければならない(MUST)。

source: The server MUST only target the values of to, cc, and/or audience on the original object being forwarded, and not pick up any new addressees whilst recursing through the linked objects (in case these addressees were purposefully amended by or via the client).
ja: サーバは転送された元のオブジェクトの to, cc, audience の値のみを ターゲットし、(これらのアドレスが意図的に変更されたりクライアントによって) リンクされたオブジェクトを再帰している間の新しい受信者を拾わないように しなかければならない(MUST)。

source: The server MUST perform de-duplication of activities returned by the inbox.
ja: サーバは inbox に返されたアクティビティの重複解消を 実行しなければならない(MUST)。

source: The server MUST remove the bto and/or bcc properties, if they exist, from the ActivityStreams object before delivery, but MUST utilize the addressing originally stored on the bto / bcc properties for determining recipients in delivery.
ja: ActivityStreams オブジェクトに bto や bcc 属性がある 場合、サーバは配送の前にこれらを削除しなければならない(MUST)が、 もともと bto / bcc 属性に保管されていた宛先を delivery での宛先を決定するのに使用しなければならない(MUST)。

source: The server MUST then add this new Activity to the outbox collection.
ja: それからサーバは新しい Activity を outbox コレクションに 追加しなければならない(MUST)。

source: The server SHOULD filter content according to the requester's permission.
ja: サーバは要求者の権限に応じてコンテンツをフィルタリングするべきである(SHOULD)。

source: The server SHOULD prevent the blocked user from interacting with any object posted by the actor.
ja: サーバはブロックしたユーザーと、このアクターによって投稿された任意の オブジェクトとの相互作用を防止するべきである (SHOULD)。

source: The server SHOULD recurse through these values to look for linked objects owned by the server, and SHOULD set a maximum limit for recursion (ie. the point at which the thread is so deep the recipients followers may not mind if they are no longer getting updates that don't directly involve the recipient).
ja: サーバは、自身が所有しているリンクされたオブジェクトを探すためにこれらの値を 再帰するべきであり(SHOULD)、 再帰の上限を設定するべきである(SHOULD) (つまり、スレッドが深くなった時点で、受信フォロワーは、 受信者に直接関係ない更新を受け取らなくても気にしないかもしれない)。

source: The server then MUST attach this object as the object of a Create Activity.
ja: サーバはこのオブジェクトを Create Activity の object として添付しなければならない(MUST)。

source: The side effect of receiving this in an inbox is determined by the type of the object received, and it is possible to accept types not described in this document (for example, an Offer).
ja: これを inbox に受信した場合の副作用は、受信した object の型によって決定され、(例えば Offer のような) この文書に記述していない型を受け入れることも可能である。

source: The side effect of receiving this in an inbox is determined by the type of the object received, and it is possible to reject types not described in this document (for example, an Offer).
ja: これを inbox に受信することによる副作用は、 受信した object の型によって決定され、 この文書に記述されていない型 (例えば Offer)を 拒否することもできる。

source: The side effect of receiving this in an inbox is that the server SHOULD generate either an Accept or Reject activity with the Follow as the object and deliver it to the actor of the Follow.
ja: これを inbox に受信したときの副作用として、 サーバは、この Follow を object に設定した Accept または Reject アクティビティを生成し、 Follow した actor に配送するべきである(SHOULD)。

source: The side effect of receiving this in an inbox is that the server SHOULD increment the object's count of likes by adding the received activity to the likes collection if this collection is present.
ja: これを inbox に受信したときの副作用として、 サーバは、likes コレクションがある場合は、 このコレクションに受信したアクティビティを追加することで このオブジェクトのいいねのカウントを増やすべきである (SHOULD)。

source: The side effect of receiving this in an outbox is that the server SHOULD add the object to the actor's following Collection when and only if an Accept activity is subsequently received with this Follow activity as its object.
ja: これを outbox に受信した場合の副作用として、 サーバは、この Follow アクティビティをオブジェクトとした Accept アクティビティを引き続いて受信した場合にのみ、 actor の following コレクション に object を追加するべきである(SHOULD)。

source: The side effect of receiving this in an outbox is that the server SHOULD add the object to the actor's liked Collection.
ja: これを outbox に受信したときの副作用として、 サーバは actor の liked コレクション に この object を追加するべきである(SHOULD)。

source: The side effect of receiving this is that (assuming the object is owned by the sending actor / server) the server receiving the delete activity SHOULD remove its representation of the object with the same id, and MAY replace that representation with a Tombstone object.
ja: object が送信した actor / server が所有していると仮定して) これを受信したときの副作用として、 delete アクティビティを受信したサーバは 同じ id を持つ object の表現を削除するべき(SHOULD)で、 表現を Tombstone オブジェクトに置き換えても良い(MAY)。

source: The side effect of this is that the object MUST be modified to reflect the new structure as defined in the update activity, assuming the actor has permission to update this object.
ja: これの副作用として、actor がこのオブジェクトを更新する権限を持っている場合、 object は Update アクティビティで定義されている新しい構造を 反映した形で修正されなければならない(MUST)。

source: The side effect of this is that the server MAY replace the object with a Tombstone of the object that will be displayed in activities which reference the deleted object.
ja: この副作用として、サーバは object を、 削除されたオブジェクトを参照するアクティビティで表示される Tombstone のオブジェクトに置き換えても良い(MAY)。

source: The type of the object.
ja: オブジェクトの型。

source: The undo activity and the activity being undone MUST both have the same actor.
ja: Undo アクティビティと取り消されるアクティビティはどちらも同じ actor を 持っていなければならない(MUST)。

source: The value of source is itself an object which uses its own content and mediaType fields to supply source information.
ja: source の値は、 ソース情報を提供するために自身の content と mediaType フィールドを持つオブジェクトである。

source: The values of inReplyTo, object, target and/or tag are objects owned by the server.
ja: inReplyTo, object, target, tag の値が サーバが所有しているオブジェクトである。

source: The values of to, cc, and/or audience contain a Collection owned by the server.
ja: to, cc, audience の値に サーバが所有しているコレクションが含まれている。

source: There are many types of URIs aside from just http and https.
ja: http と https に加えて、様々な種類の URI がある。

source: There are some exceptions where there is an existing and explicit "inverse activity" which should be used instead.
ja: 既存の明示的な「逆アクティビティ」を代わりに使うべき例外がある。

source: There may be multiple human users or organizations controlling an Actor, or likewise one human or organization may control multiple Actors.
ja: ある Actor を複数の人間や組織が制御しているかもしれないし、 一人の人間や組織が複数の Actor を制御しているかもしれない。

source: These are described per individual Activity below.
ja: これらは後述する個々の Activity に記述されている。

source: These are endpoints, or really, just URLs which are listed in the ActivityPub actor's ActivityStreams description.
ja: これらはエンドポイント、つまり実際には ActivityPub actor の ActivityStreams 記述にある単なる URL です。

source: These fields will have been populated appropriately by the client which posted the Activity to the outbox.
ja: これらのフィールドは、このアクティビティをoutboxに投稿した クライアントによって適切に展開されている。

source: These identifiers must fall into one of the following groups:
ja: これらの識別子は以下のグループのどれか一つでなければならない:

source: These revisions lead to cleaner separation between the client to server and server components, along with clarity about ActivityPub's relationship to [LDN], among many other improvements.
ja: これらの改訂により、様々な改良の中でも、ActivityPub の [LDN] との関係の 明確化と、クライアント-サーバ通信とサーバ間通信のより明確な分離が行われた。

source: These terms are provided in the ActivityPub JSON-LD context at https://www.w3.org/ns/activitystreams.
ja: これらの用語は https://www.w3.org/ns/activitystreams で ActivityPub JSON-LD context として提供される。

source: These will be discussed by the Social Web Community Group and considered in any future versions of this specification.
ja: これらは Social Web Community Group によって 議論され、この仕様の将来のバージョンで考慮される。

source: They both behave differently for GET and POST.
ja: これらはそれぞれ GET と POST で異なった振る舞いをします。

source: This Activity is added by the receiver as an item in the inbox OrderedCollection.
ja: このアクティビティは受信者によって inbox OrderedCollection の item として追加される。

source: This allows recipient servers to:
ja: これにより、宛先サーバは:

source: This can be done using, for example, some kind of ratelimiting mechanism.
ja: これは、例えば、ある種のレート制限機構のようなものを使うことで実現できる。

source: This could potentially be all relevant objects published by the user, though the number of available items is left to the discretion of those implementing and deploying the server.
ja: これは場合によってはそのユーザーによって発行された、全ての関連する オブジェクトとなるかもしれないが、 利用可能なアイテムの数はサーバの実装とデプロイの自由裁量に任されている。

source: This designation applies to any implementation of the entirety of the client portion of the client to server protocol.
ja: この指定は、クライアント-サーバプロトコルのクライアント部分を全て 実装しているものに適用される。

source: This designation applies to any implementation of the entirety of the federation protocols.
ja: この指定は、連合プロトコルを全て実装しているものに 適用される。

source: This designation applies to any implementation of the entirety of the server portion of the client to server protocol.
ja: この指定は、クライアント-サーバプロトコルのサーバ部分を全て 実装しているものに適用される。

source: This document has been reviewed by W3C Members, by software developers, and by other W3C groups and interested parties, and is endorsed by the Director as a W3C Recommendation.
ja: この文書は、W3Cメンバー、ソフトウェア開発者、およびその他のW3Cグループと関係者によってレビューされ、W3C勧告としてディレクターによって承認されています。

source: This document is dedicated to all citizens of planet Earth.
ja: この文書は地球上の全ての住民に捧げる。

source: This document is governed by the 1 March 2017 W3C Process Document.
ja: この文書は、1 March 2017 W3C Process Documentに準拠する。

source: This document may contain errors due to translations.
ja: この文書には翻訳による誤りが含まれることがあります。

source: This document was produced by a group operating under the W3C Patent Policy.
ja: この文書は、W3C Patent Policyの下で活動しているグループによって作成された。

source: This document was published by the Social Web Working Group as a Recommendation.
ja: この文書は Social Web Working Group によって 勧告として発行された。

source: This enhances the functionality and interoperability of the Web.
ja: これは、Webの機能性と相互運用性を向上させる。

source: This gives three conformance classes:
ja: これは三つの準拠クラスを与える:

source: This has the side effect that the object embedded within the Activity (in the object property) is created.
ja: これは、Activity の中に(object 属性として)埋め込まれている オブジェクトが作成されるという副作用がある。

source: This is a Japanese translation of ActivityPub .
ja: これはActivityPubの参考日本語訳です。

source: This is a collection of Like activities performed by the actor, added to the collection as a side effect of delivery to the outbox.
ja: これは このアクターによって 行われた Like アクティビティのコレクションで、 outbox への配送の副作用 として コレクションに追加される。

source: This is a collection of Like activities referencing this object, added to the collection as a side effect of delivery to the inbox.
ja: これはこのオブジェクトを参照している Like アクティビティの コレクションで、 inbox への配達の副作用 として コレクションに追加される。

source: This is a list of all Announce activities with this object as the object property, added as a side effect.
ja: これは、このオブジェクトを object 属性に含む全ての Announce アクティビティの一覧で、 副作用 として追加されたものである。

source: This is a list of all Like activities with this object as the object property, added as a side effect.
ja: これは 副作用 として追加された、 このオブジェクトを object 属性として持つ全ての Like アクティビティの一覧である。

source: This is a list of every object from all of the actor's Like activities, added as a side effect.
ja: これは 副作用 として追加された、 この actor の全ての Like のオブジェクトの一覧である。

source: This is a list of everybody that the actor has followed, added as a side effect.
ja: これは 副作用 として追加された、 この actor がフォローした相手の一覧である。

source: This is a list of everyone who has sent a Follow activity for the actor, added as a side effect.
ja: これはこの actor に Follow アクティビティを送信したときに 副作用 として追加された送信者の一覧である。

source: This is a note addressed to Ben.
ja: これは Ben に向けた note です。

source: This is pretty great because ActivityStreams includes all the common terms you need to represent all the activities and content flowing around a social network.
ja: これはなかなか素晴らしいことです; ActivityStreams はソーシャルネットワークに 流れる全てのアクティビティと内容を表現する全ての一般的な用語を 含んでいるからです。

source: This is the first time the server has seen this Activity.
ja: サーバがこの Activity を見るのは初めてである。

source: This is where one would find a list of all the actors that are following the actor.
ja: これは誰かがある actor をフォローしている全てのユーザーの一覧を 見つける場所である。

source: This makes the Followers collection an appropriate default target for delivery of notifications.
ja: これにより、Followers コレクションは通知の 配送 の 適切なデフォルトターゲットになる。

source: This mapping may be nested inside the actor document as the value or may be a link to a JSON-LD document with these properties.
ja: このマッピングは actor 文書の中で値としてネストしても良いし、 これらの属性を持つ JSON-LD 文書へのリンクでも良い。

source: This only applies to the top-level fields of the updated object.
ja: これは更新されるオブジェクトの最上位のフィールドにのみ適用される。

source: This problem is best demonstrated with an example.
ja: この問題を例で示す。

source: This protocol is used to distribute activities between actors on different servers, tying them into the same social graph.
ja: このプロトコルは、異なるサーバにあり、同じソーシャルグラフ上で 結びつけられているactorの間でアクティビティを配布するために使われる。

source: This protocol permits a client to act on behalf of a user.
ja: このプロトコルは、クライアントがユーザーに代わって行動することを認める。

source: This serves two purposes:
ja: これは二つの目的がある:

source: This specification comes from years of hard work and experience by a number of communities exploring the space of federation on the web.
ja: この仕様は、web 上の連合空間を探索する多くのコミュニティによる、 何年にもわたる多大な努力と経験に由来する。

source: This specification defines two closely related and interacting protocols:
ja: この仕様は、密接に関連し相互に作用する二つのプロトコルを定義する:

source: This would be very confusing!
ja: これはとても混乱します!

source: Thus ActivityPub provides an optional mechanism for serving these two use cases.
ja: 従って ActivityPub はこれら二つのユースケースを扱うためのオプションの機構を 提供する。

source: Thus in this scenario, the remote/receiving server participates in determining targeting and performing delivery to specific inboxes.
ja: 従ってこのシナリオでは、 リモート/受信サーバは特定の inbox へのターゲットと配送の実行の 決定に関与する。

source: Timeframes and behavior for dealing with unreachable actors are left to the discretion of the delivering server.
ja: 到達不能な actor を扱うための期間と振る舞いは配送サーバの 裁量に委ねられている。

source: To do this, clients MUST discover the URL of the actor's outbox from their profile and then MUST make an HTTP POST request to this URL with the Content-Type of application/ld+json; profile="https://www.w3.org/ns/activitystreams".
ja: これを行うために、クライアントは actor の profile からその outbox の URL を 発見しなければならず(MUST)、 それから、Content-Type に application/ld+json; profile="https://www.w3.org/ns/activitystreams" を指定した POST リクエストをこの URL に行わなければならない(MUST)。

source: To do this, the server MUST target and deliver to the values of to, cc, and/or audience if and only if all of the following are true:
ja: これを行うために、サーバは次の全てが真の場合にのみ、 to, cc, audience の値にターゲットして 配送 しなければならない(MUST):

source: To some extent, this is dependent upon the particular client implementation, but clients must be aware that the server will only forward new Activities to addressees in the to, bto, cc, bcc, and audience fields.
ja: これはある程度特定のクライアントの実装に依存するが、 サーバは新しい Activity を to, bto, cc, bcc, audience フィールドのアドレス指定先にのみ 転送する、ということをクライアントは認識しておかなければならない。

source: To use this endpoint, the client posts an x-www-form-urlencoded id parameter with the value being the id of the requested ActivityStreams object.
ja: このエンドポイントを使うには、クライアントは 要求する ActivityStreams オブジェクトの id の値を持つ x-www-form-urlencoded id 引数を 投稿する。

source: Unfortunately at the time of standardization, there are no strongly agreed upon mechanisms for authentication.
ja: 残念ながら標準化の時点で、認証機構として強力に合意されたものはない。

source: Unlike the client to server handling of the Update activity, this is not a partial update but a complete replacement of the object.
ja: Update アクティビティのクライアントからサーバへの扱い と異なり、 これは部分更新ではなくオブジェクトの完全な置き換えである。

source: Upon receipt of a Remove activity into the inbox, the server SHOULD remove the object from the collection specified in the target property, unless:
ja: Remove アクティビティを inbox に受け取ったとき、 次のような場合を除いて、サーバは target 属性で指定された コレクションから object を除去するべきである (SHOULD):

source: Upon receipt of a Remove activity into the outbox, the server SHOULD remove the object from the collection specified in the target property, unless:
ja: outbox に Remove アクティビティを受信すると、 サーバは次の場合を除いて、 target 属性で指定されたコレクションから object を削除するべきである(SHOULD)。

source: Upon receipt of an Add activity into the inbox, the server SHOULD add the object to the collection specified in the target property, unless:
ja: Add アクティビティを inbox に受け取ったとき、 次のような場合を除いて、サーバは target 属性で指定された コレクションに object を追加するべきである (SHOULD):

source: Upon receipt of an Add activity into the outbox, the server SHOULD add the object to the collection specified in the target property, unless:
ja: Add アクティビティを outbox に受け取ったとき、 以下の場合を除いて、サーバは object を target プロパティで指定されたコレクションに追加するべきである(SHOULD):

source: Upon receipt of an Announce activity in an inbox, a server SHOULD increment the object's count of shares by adding the received activity to the shares collection if this collection is present.
ja: Announce アクティビティを inbox に 受け取ったとき、サーバは、shares コレクションがある場合は、このコレクションに受信したアクティビティを 追加することで、 このオブジェクトの共有のカウントを増やすべきである (SHOULD)。

source: User's accounts on different servers correspond to different actors.
ja: 異なるサーバのユーザーアカウントはそれぞれ異なったアクターに対応します。

source: We also thank mray for producing the spectacular tutorial illustrations (which are licensed under the same license as the rest of this document).
ja: 我々はまた、素晴らしいチュートリアルイラスト (これはこの文書の他の部分と同じライセンスが適用されている) を作成した mray にも感謝する。

source: What is used isn't important, but the ordering of elements must remain intact, with newer items first.
ja: 何が使われるかは重要ではないが、新しいアイテムが最初になるような形で 要素の順序が保持されていなければならない。

source: What property is used to determine the reverse chronological order is intentionally left as an implementation detail.
ja: 逆時系列順を決定するのにどの属性が使われるかは、意図的に実装詳細として 残してある。

source: What to do when there are no recipients specified is not defined, however it's recommended that if no recipients are specified the object remains completely private and access controls restrict the access to object.
ja: 宛先がない場合にどうするかは未定義であるが、もし宛先が指定されなかった場合、 オブジェクトを完全にプライベートな状態において、アクセスコントロールは そのオブジェクトへのアクセスを制限することが推奨される。

source: When Activities are received in the inbox, the server needs to forward these to recipients that the origin was unable to deliver them to.
ja: Activity を inbox に受信したとき、 サーバはこれらを送信元が配信できない宛先に転送する必要がある。

source: When a Create activity is posted, the actor of the activity SHOULD be copied onto the object's attributedTo field.
ja: Create アクティビティが投稿されたとき、アクティビティの actor は object の attributedTo フィールドにコピーされるべきである(SHOULD)。

source: When an object is being delivered to the originating actor's followers, a server MAY reduce the number of receiving actors delivered to by identifying all followers which share the same sharedInbox who would otherwise be individual recipients and instead deliver objects to said sharedInbox.
ja: 配送元actorのfollowersにオブジェクトが配送されるとき、 サーバは、同じ sharedInbox を持つ全ての フォロワーを識別して、 代わりにオブジェクトを sharedInbox という名前に配送することで 配送する受信アクターの数を減らしても良い(MAY)。

source: When entered directly into a user interface (for example on a login form), it is desirable to support simplified naming.
ja: (例えばログインフォームのような)ユーザーインターフェースから直接入力された 場合、単純化した命名規則に対応しているのが望ましい。

source: When objects are received in the outbox (for servers which support both Client to Server interactions and Server to Server Interactions), the server MUST target and deliver to:
ja: オブジェクトを outbox に受信したとき( クライアントからサーバへの通信 と サーバからサーバへの通信 の両方に対応しているサーバの場合)、サーバは 以下にターゲットして配送しなければならい(MUST):

source: While a client could feasibly provide the content markup to be edited and ignore the source, this means that the user will lose the more desirable form of the original source in any future revisions.
ja: クライアントは編集するための content を都合良く提供して ソースを無視するかもしれないが、これはユーザーが将来の編集で元の source の望ましい形式を失うことを意味する。

source: While it is not required reading to understand this specification, it is worth noting that ActivityPub's targeting and delivery mechanism overlaps with the Linked Data Notifications specification, and the two specifications may interoperably combined.
ja: この仕様を理解するのに読むのは必須ではないが、 ActivityPub のターゲットと配送の機構は Linked Data Notifications 仕様と 重複していて、二つの仕様は相互に結合できることは記しておく価値がある。

source: While no specific mechanism for combating spam is provided in ActivityPub, it is recommended that servers filter incoming content both by local untrusted users and any remote users through some sort of spam filter.
ja: ActivityPub ではスパムと闘うための特定の機構は提供しないが、 サーバは、ある種のスパムフィルタを通してローカルの信頼できないユーザーと全ての リモートユーザーの両方から入力される内容をフィルタリングすることが勧められる。

source: Without the following mechanism, if Alyssa were then to reply to Ben, her followers would see Alyssa replying to Ben without having ever seen Ben interacting.
ja: 次の機構がない場合、その後 Alyssa が Ben に返信すると、 彼女のフォロワーは、Ben の返信を見ることなく Alyssa が Ben に返信するのを 見ることになります。

source: You can GET from someone's outbox to see what messages they've posted (or at least the ones you're authorized to see).
ja: あなたは誰か(あるいは少なくともあなたが読むことを許されている人)が どんなメッセージを書いたかを見るためにその人の outbox を GET できます。

source: You can GET from your inbox to read your latest messages (client-to-server; this is like reading your social network stream)
ja: あなたはあなたの最新のメッセージを読むためにあなたの inbox を GET できます (クライアントからサーバ; これはあなたのソーシャルネットワークストリームを 読むようなものです)
